function [M] = Func_getGyroRotateMatrix(g)
%     M = [    0,  g(1),  g(2),  g(3);
%          -g(1),     0, -g(3),  g(2);
%          -g(2),  g(3),     0, -g(1);
%          -g(3), -g(2),  g(1),    0];

% 
    M = [    0,  g(1),  g(2),  g(3);
         -g(1),     0,  g(3), -g(2);
         -g(2), -g(3),     0,  g(1);
         -g(3),  g(2),  -g(1),   0];
    
%% 这个是互补滤波角速度的解算方法。
%     ab = [  b(1) -b(2) -b(3) -b(4);
%             b(2) +b(1) +b(4) -b(3);
%             b(3) -b(4) +b(1) +b(2);
%             b(4) +b(3) -b(2) +b(1);]

end